---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDirn1
source: html/71a6ebc9-35f0-f23d-f0d3-ede51cc303f6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpacingTopDirn1 Property

"Top Major Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpacingTopDirn1 { get; }
```